<?php

declare(strict_types=1);

namespace AtolOnline\Enums;

/**
 * Значения реквизита «Идентификатор ФОИВ» (тег 1262)
 */
enum IdentifierFOIV: string
{
    /**
     * Министерство внутренних дел Российской Федерации
     */
    case I001 = '001';

    /**
     * Министерство Российской Федерации по делам гражданской обороны,
     * чрезвычайным ситуациям и ликвидации последствий стихийных бедствий
     */
    case I002 = '002';

    /**
     * Министерство иностранных дел Российской Федерации
     */
    case I003 = '003';

    /**
     * Федеральное агентство по делам Содружества Независимых Государств,
     * соотечественников, проживающих за рубежом, и по международному гуманитарному сотрудничеству
     */
    case I004 = '004';

    /**
     * Министерство обороны Российской Федерации
     */
    case I005 = '005';

    /**
     * Федеральная служба по военно-техническому сотрудничеству
     */
    case I006 = '006';

    /**
     * Федеральная служба по техническому и экспортному контролю
     */
    case I007 = '007';

    /**
     * Министерство юстиции Российской Федерации
     */
    case I008 = '008';

    /**
     * Федеральная служба исполнения наказаний
     */
    case I009 = '009';

    /**
     * Федеральная служба судебных приставов
     */
    case I010 = '010';

    /**
     * Государственная фельдъегерская служба Российской Федерации (федеральная служба)
     */
    case I011 = '011';

    /**
     * Служба внешней разведки Российской Федерации (федеральная служба)
     */
    case I012 = '012';

    /**
     * Федеральная служба безопасности Российской Федерации (федеральная служба)
     */
    case I013 = '013';

    /**
     * Федеральная служба войск национальной гвардии Российской Федерации (федеральная служба)
     */
    case I014 = '014';

    /**
     * Федеральная служба охраны Российской Федерации (федеральная служба)
     */
    case I015 = '015';

    /**
     * Федеральная служба по финансовому мониторингу (федеральная служба)
     */
    case I016 = '016';

    /**
     * Федеральное архивное агентство (федеральное агентство)
     */
    case I017 = '017';

    /**
     * Главное управление специальных программ Президента Российской Федерации (федеральное агентство)
     */
    case I018 = '018';

    /**
     * Управление делами Президента Российской Федерации (федеральное агентство)
     */
    case I019 = '019';

    /**
     * Министерство здравоохранения Российской Федерации
     */
    case I020 = '020';

    /**
     * Федеральная служба по надзору в сфере здравоохранения
     */
    case I021 = '021';

    /**
     * Министерство культуры Российской Федерации
     */
    case I022 = '022';

    /**
     * Министерство науки и высшего образования Российской Федерации
     */
    case I023 = '023';

    /**
     * Министерство природных ресурсов и экологии Российской Федерации
     */
    case I024 = '024';

    /**
     * Федеральная служба по гидрометеорологии и мониторингу окружающей среды
     */
    case I025 = '025';

    /**
     * Федеральная служба по надзору в сфере природопользования
     */
    case I026 = '026';

    /**
     * Федеральное агентство водных ресурсов
     */
    case I027 = '027';

    /**
     * Федеральное агентство лесного хозяйства
     */
    case I028 = '028';

    /**
     * Федеральное агентство по недропользованию
     */
    case I029 = '029';

    /**
     * Министерство промышленности и торговли Российской Федерации
     */
    case I030 = '030';

    /**
     * Федеральное агентство по техническому регулированию и метрологии
     */
    case I031 = '031';

    /**
     * Министерство просвещения Российской Федерации
     */
    case I032 = '032';

    /**
     * Министерство Российской Федерации по развитию Дальнего Востока и Арктики
     */
    case I033 = '033';

    /**
     * Министерство сельского хозяйства Российской Федерации
     */
    case I034 = '034';

    /**
     * Федеральная служба по ветеринарному и фитосанитарному надзору
     */
    case I035 = '035';

    /**
     * Федеральное агентство по рыболовству
     */
    case I036 = '036';

    /**
     * Министерство спорта Российской Федерации
     */
    case I037 = '037';

    /**
     * Министерство строительства и жилищно-коммунального хозяйства Российской Федерации
     */
    case I038 = '038';

    /**
     * Министерство транспорта Российской Федерации
     */
    case I039 = '039';

    /**
     * Федеральная служба по надзору в сфере транспорта
     */
    case I040 = '040';

    /**
     * Федеральное агентство воздушного транспорта
     */
    case I041 = '041';

    /**
     * Федеральное дорожное агентство
     */
    case I042 = '042';

    /**
     * Федеральное агентство железнодорожного транспорта
     */
    case I043 = '043';

    /**
     * Федеральное агентство морского и речного транспорта
     */
    case I044 = '044';

    /**
     * Министерство труда и социальной защиты Российской Федерации
     */
    case I045 = '045';

    /**
     * Федеральная служба по труду и занятости
     */
    case I046 = '046';

    /**
     * Министерство финансов Российской Федерации
     */
    case I047 = '047';

    /**
     * Федеральная налоговая служба
     */
    case I048 = '048';

    /**
     * Федеральная пробирная палата (федеральная служба)
     */
    case I049 = '049';

    /**
     * Федеральная служба по регулированию алкогольного рынка
     */
    case I050 = '050';

    /**
     * Федеральная таможенная служба
     */
    case I051 = '051';

    /**
     * Федеральное казначейство (федеральная служба)
     */
    case I052 = '052';

    /**
     * Федеральное агентство по управлению государственным имуществом
     */
    case I053 = '053';

    /**
     * Министерство цифрового развития, связи и массовых коммуникаций Российской Федерации
     */
    case I054 = '054';

    /**
     * Федеральная служба по надзору в сфере связи, информационных технологий и массовых коммуникаций
     */
    case I055 = '055';

    /**
     * Федеральное агентство по печати и массовым коммуникациям
     */
    case I056 = '056';

    /**
     * Федеральное агентство связи
     */
    case I057 = '057';

    /**
     * Министерство экономического развития Российской Федерации
     */
    case I058 = '058';

    /**
     * Федеральная служба по аккредитации
     */
    case I059 = '059';

    /**
     * Федеральная служба государственной статистики
     */
    case I060 = '060';

    /**
     * Федеральная служба по интеллектуальной собственности
     */
    case I061 = '061';

    /**
     * Федеральное агентство по туризму
     */
    case I062 = '062';

    /**
     * Министерство энергетики Российской Федерации
     */
    case I063 = '063';

    /**
     * Федеральная антимонопольная служба
     */
    case I064 = '064';

    /**
     * Федеральная служба государственной регистрации, кадастра и картографии
     */
    case I065 = '065';

    /**
     * Федеральная служба по надзору в сфере защиты прав потребителей и благополучия человека
     */
    case I066 = '066';

    /**
     * Федеральная служба по надзору в сфере образования и науки
     */
    case I067 = '067';

    /**
     * Федеральная служба по экологическому, технологическому и атомному надзору
     */
    case I068 = '068';

    /**
     * Федеральное агентство по государственным резервам
     */
    case I069 = '069';

    /**
     * Федеральное медико-биологическое агентство
     */
    case I070 = '070';

    /**
     * Федеральное агентство по делам молодежи
     */
    case I071 = '071';

    /**
     * Федеральное агентство по делам национальностей
     */
    case I072 = '072';
}
